Processing data from triantaphyllou 1981 Table 1 into a pandas dataframe

Triantaphyllou AC: Oogenesis and the Chromosomes of the Parthenogenic Root-knot Nematode Meloidogyne incognita. J Nematol 1981, 13:95â€“104.

In [1]:
%matplotlib inline
import pandas as pd

In [19]:
data = pd.read_csv(
    'Triant81raceA.csv')
data.head()

   Isolate Country
0   4-N.C.     USA
1  19-N.C.     USA
2  73-Fla.     USA
3  22-N.C.     USA
4  79-Ohio     USA

In [21]:
filled = data
filled.head()

   Isolate Country
0   4-N.C.     USA
1  19-N.C.     USA
2  73-Fla.     USA
3  22-N.C.     USA
4  79-Ohio     USA

In [22]:
filled.insert(0,'Species','M. incognita')
filled.head()

        Species  Isolate Country
0  M. incognita   4-N.C.     USA
1  M. incognita  19-N.C.     USA
2  M. incognita  73-Fla.     USA
3  M. incognita  22-N.C.     USA
4  M. incognita  79-Ohio     USA

In [23]:
filled.insert(3,'Reproduction','apomixis')
filled.head()

        Species  Isolate Country Reproduction
0  M. incognita   4-N.C.     USA     apomixis
1  M. incognita  19-N.C.     USA     apomixis
2  M. incognita  73-Fla.     USA     apomixis
3  M. incognita  22-N.C.     USA     apomixis
4  M. incognita  79-Ohio     USA     apomixis

In [24]:
filled.insert(1,'csome_low','40')
filled.head()

        Species csome_low  Isolate Country Reproduction
0  M. incognita        40   4-N.C.     USA     apomixis
1  M. incognita        40  19-N.C.     USA     apomixis
2  M. incognita        40  73-Fla.     USA     apomixis
3  M. incognita        40  22-N.C.     USA     apomixis
4  M. incognita        40  79-Ohio     USA     apomixis

In [25]:
filled.insert(2,'csome_high','46')
filled.head()

        Species csome_low csome_high  Isolate Country Reproduction
0  M. incognita        40         46   4-N.C.     USA     apomixis
1  M. incognita        40         46  19-N.C.     USA     apomixis
2  M. incognita        40         46  73-Fla.     USA     apomixis
3  M. incognita        40         46  22-N.C.     USA     apomixis
4  M. incognita        40         46  79-Ohio     USA     apomixis

In [26]:
filled.insert(3,'N','1')
filled.head()

        Species csome_low csome_high  N  Isolate Country Reproduction
0  M. incognita        40         46  1   4-N.C.     USA     apomixis
1  M. incognita        40         46  1  19-N.C.     USA     apomixis
2  M. incognita        40         46  1  73-Fla.     USA     apomixis
3  M. incognita        40         46  1  22-N.C.     USA     apomixis
4  M. incognita        40         46  1  79-Ohio     USA     apomixis

In [27]:
filled.insert(7, 'Reference', 'Triantaphyllou AC: Oogenesis and the Chromosomes of the Parthenogenic Root-knot Nematode Meloidogyne incognita. J Nematol 1981, 13:95â€“104.')
filled.head()

,Species,csome_low,csome_high,N,Isolate,Country,Reproduction,Reference
0,M. incognita,40,46,1,4-N.C.,USA,apomixis,Triantaphyllou AC: Oogenesis and the Chromosom...
1,M. incognita,40,46,1,19-N.C.,USA,apomixis,Triantaphyllou AC: Oogenesis and the Chromosom...
2,M. incognita,40,46,1,73-Fla.,USA,apomixis,Triantaphyllou AC: Oogenesis and the Chromosom...
3,M. incognita,40,46,1,22-N.C.,USA,apomixis,Triantaphyllou AC: Oogenesis and the Chromosom...
4,M. incognita,40,46,1,79-Ohio,USA,apomixis,Triantaphyllou AC: Oogenesis and the Chromosom...

In [29]:
filled.to_csv('raceA.csv', index=False)